
#ifndef __COMM_TEST_BASE_H__
#define __COMM_TEST_BASE_H__

#include "comm/comm_base.h"

using namespace std;

struct INPUT_INFO_STRU
{
    CHAR        inputKey;
    INT32       val;
    std::string strDes;
};

/**************************************************************************************
功能描述: 获取界面输入键值
修改记录:
**************************************************************************************/
CHAR GetInputKey(void);

/**************************************************************************************
功能描述: 等待并获取界面输入
修改记录:
**************************************************************************************/
INT32 WaitAndGetInputVal(const INPUT_INFO_STRU astInputInfo[], UINT32 numOfInputInfo);

/**************************************************************************************
功能描述: 判断是否为仿真模式
修改记录:
**************************************************************************************/
BOOL IsSerialSimulationMode(int argc, char** argv);

/**************************************************************************************
功能描述: 判断是否忽略配置文件防修改校验
修改记录:
**************************************************************************************/
BOOL IsIgnoreCfgParamFileModChecking(int argc, char** argv);


#endif

