
#ifndef __COMM_TEST_H__
#define __COMM_TEST_H__

#include <string>

struct INPUT_INFO_STRU
{
    char        inputKey;
    int         val;
    std::string strDes;
};

/**************************************************************************************
功能描述: 获取界面输入键值
修改记录:
**************************************************************************************/
char GetInputKey(void);

/**************************************************************************************
功能描述: 等待并获取界面输入
修改记录:
**************************************************************************************/
int WaitAndGetInputVal(const INPUT_INFO_STRU astInputInfo[], unsigned int numOfInputInfo);

/**************************************************************************************
功能描述: 判断是否为仿真模式
修改记录:
**************************************************************************************/
bool IsSerialSimulationMode(int argc, char** argv);

/**************************************************************************************
功能描述: 判断是否忽略配置文件防修改校验
修改记录:
**************************************************************************************/
bool IsIgnoreCfgParamFileModChecking(int argc, char** argv);


#endif

